---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SpaceType
source: html/510b0084-dabb-815c-d8ee-891abf64b07d.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceType

An enumerated type listing all the possible space types for a space object.

## Syntax (C#)
```csharp
public enum SpaceType
```